x = [-1 -0.7 -0.4 -0.1 0.2 0.5 0.8];
y = [-1 -0.7 -0.4 -0.1 0.2 0.5 0.8];
Z = [1.5 0.99 0.66 0.51 0.54 0.75 1.14;
    1.245 0.735 0.405 0.255 0.285 0.495 0.885;
    1.08 0.57 0.24 0.09 0.12 0.33 0.72;
    1.005 0.495	0.165 0.015	0.045 0.255	0.645;
    1.02 0.51 0.18 0.03 0.06 0.27 0.66;
    1.125 0.615 0.285 0.135 0.165 0.375 0.765;
    1.32 0.81 0.48 0.33 0.36 0.57 0.96];

mesh(x,y,Z);
xi = -1 : 0.1 : 0.8;
yi = -1 : 0.1 : 0.8;
% 最邻近插值
Zi = interp2(x,y,Z,xi',yi,'nearest');
figure(2)
mesh(xi,yi,Zi);

% 双线性插值
Zi = interp2(x,y,Z,xi',yi,'linear');
figure(3)
mesh(xi,yi,Zi);

% 双三次插值
Zi = interp2(x,y,Z,xi',yi,'cubic');
figure(4)
mesh(xi,yi,Zi);

x1 = -0.94;
y1 = 0.9;
Z1 = griddata(x,y,Z,x1,y1,'nearest');

x2 = 0.51;
y2 = -0.37;
Z2 = griddata(x,y,Z,x2,y2,'nearest');

x3 = 0.03;
y3 = 0.61;
Z3 = griddata(x,y,Z,x3,y3,'nearest');


